**Задание 1**:
Создайте numpy array с элементами от числа N до 0 (например, для N = 10 это будет array([9, 8, 7, 6, 5, 4, 3, 2, 1, 0])).

In [1]:
import numpy as np
n=10
np.arange(n-1,-1,-1)

array([9, 8, 7, 6, 5, 4, 3, 2, 1, 0])

**Задание 2**:
Создайте диагональную матрицу с элементами от N до 0. Посчитайте сумму ее значений на диагонали.

In [2]:
#значения вне диагонали диагональной матрицы равны нулю, т.о. найдем сумму значений на диагонали через функцию sum()
n=10
np.diag(np.arange(n)).sum()

45

**Задание 3**:
Скачайте с сайта https://grouplens.org/datasets/movielens/ датасет любого размера. Определите какому фильму было выставлено больше всего оценок 5.0.

In [3]:
#http://files.grouplens.org/datasets/movielens/ml-1m.zip (1KK ratings from 6K users on 4K movies. Released 2/2003)

In [4]:
import pandas as pd
ratings = pd.read_csv('ratings.csv')
ratings.head()

   userId  movieId  rating   timestamp
0       1      110     1.0  1425941529
1       1      147     4.5  1425942435
2       1      858     5.0  1425941523
3       1     1221     5.0  1425941546
4       1     1246     5.0  1425941556

In [5]:
ratings[ratings['rating'] == 5.0].groupby(['movieId']).count().sort_values(by='rating',ascending=[False]).filter(items = ['movieId', 'rating']).head()

         rating
movieId
318        1399
296        1077
260         916
356         892
593         887

**Задание 4**: По данным файла power.csv посчитайте суммарное потребление стран Прибалтики (Латвия, Литва и Эстония) категорий 4, 12 и 21 за период с 2005 по 2010 года. Не учитывайте в расчетах отрицательные значения quantity.

In [6]:
df=pd.read_csv('power.csv')

In [7]:
#Latvia, Estonia, Lithuania
df[df['country'].isin(['Latvia','Estonia','Lithuania']) & df['category'].isin([4,12,21])& (df['year'] >= 2005) & (df['year'] <= 2010) & (df['quantity'] >=0)].groupby(['country']).sum().filter(items = ['country', 'quantity'])

           quantity
country
Estonia     63440.0
Latvia      54844.0
Lithuania  122296.0

**Задание 5**:
Решите систему уравнений:
4x + 2y + z = 4
x + 3y = 12
5y + 4z = -3

In [14]:
from numpy import linalg

a = np.array( [ [4, 2,1], [1, 3, 0], [0, 5, 4] ] )
b = np.array( [4, 12, -3] )
linalg.solve(a, b)
print('x =',linalg.solve(a, b)[0],'\ny =',linalg.solve(a, b)[1],'\nz =',linalg.solve(a, b)[-1],'\nПроверка решения:', np.allclose( np.dot(a, linalg.solve(a, b)), b ))

x = 0.4666666666666668
y = 3.844444444444444
z = -5.555555555555555
Проверка решения: True